
# 一．把分段问题理解为列表类型，利用数轴来分界及定位
# 　　企业发放段奖金根据利润提成．利润低于或等于１０万时，奖金可提１０％；利润高于十万元，低于２０万
# 元时，低于１０万元部分按１０％提成，高于１０万元的部分，可提成７.5％；２０万到４０万之间时，高于２０
# 万元的部分可提成５％；４０到６０万之间时，高于４０万元的部分可提成３％；６０万到１００万之间时，高
# 于６０万元段部分可提成１.5％，高于１００万时，超过１００万元的部分按１％提成．
# 　　输入利润，求应发放的奖金总数

lir = float(input("请输入利润:"))
lirunL = [0,10,20,40,60,100,lir]
tichenL = [0.1,0.075,0.05,0.03,0.015,0.001]
i = m = 0
while i<6:
    if lir>=lirunL[i+1]:
        m+=(lirunL[i+1]-lirunL[i])*tichenL[i]
    else:
        m += (lir-lirunL[i])*tichenL[i]
        break
    i+=1
print(m,"万元")